tap "homebrew/cask-fonts"
# tap "schollz/tap"
cask_args appdir: "~/Applications"

# Programming
brew "asdf"
brew "chezmoi"
brew "croc" # Point-to-point file transfer, schollz/tap
brew "direnv"
brew "fzf"
brew "git"
brew "gpg"
brew "hivemind"
brew "hub"
brew "lefthook" # Git hooks
brew "rename"
brew "ripgrep"
brew "starship" # prompt
brew "tmux"
brew "tree"
# Via homebrew/cask-fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "fork"
cask "insomnia"
cask "iterm2"
cask "p4v" # p4merge
# cask "virtualbox"
cask "visual-studio-code"

# Ruby dependencies
brew "openssl"
brew "readline"

# Other
# brew "ncdu" # ncurses tree-based disk usage
cask "1password"
cask "acorn"
# cask "arq" # Needs admin to install helpers, TODO: move separately
cask "calibre"
cask "firefox"
cask "handbrake"
cask "iina"
cask "insomnia"
cask "istat-menus"
cask "notable"
cask "plex"
cask "plexamp"
cask "rectangle" # Replacement for Magnet
cask "the-unarchiver"
cask "transmission"
cask "transmit"

# Social
cask "discord"

# Mac App Store
# mas "CleverFiles Cleaner"
