cask_args appdir: "~/Applications"

# Programming
brew "chezmoi"
brew "croc" # Point-to-point file transfer, schollz/tap
brew "delta"
brew "fzf"
brew "git"
brew "gpg"
brew "hivemind"
brew "gh"
brew "lefthook" # Git hooks
brew "mise"
brew "ncdu" # ncurses tree-based disk usage
brew "rename"
brew "ripgrep"
brew "starship" # prompt
brew "tree"
brew "zellij"

cask "dash"
# Via homebrew/cask-fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "fork"
cask "ghostty"
cask "p4v" # p4merge
cask "utm" # virtual machine host
# cask "virtualbox"
cask "visual-studio-code"
cask "warp"
cask "yaak"
cask "zed"

# Common Ruby dependencies
brew "libyaml"
brew "openssl"
brew "readline"

# Other
cask "1password"
cask "acorn"
# cask "arq" # Needs admin to install helpers, TODO: move separately
cask "calibre"
cask "firefox"
cask "handbrake"
cask "iina"
cask "istat-menus"
cask "modern-csv"
cask "obsidian"
cask "plex"
cask "plexamp"
cask "rectangle" # Replacement for Magnet
cask "tailscale"
cask "the-unarchiver"
cask "transmission"
cask "transmit"

# Social
cask "discord"

# Mac App Store
# mas "CleverFiles Cleaner"
